; domain
(define (domain driverlog)
  (:requirements :typing :fluents) 
  (:types           location locatable - object
		driver truck obj - locatable)

  (:predicates 
		(at ?obj - locatable ?loc - location)
		(in ?obj1 - obj ?obj - truck)
		(driving ?d - driver ?v - truck)
		(link ?x  - location ?y - location) 
		(path ?x  - location ?y - location)
		(empty ?v - truck)
)
  (:functions 	
		(time-to-drive ?l1 - location ?l2 - location)
		(fuel-used)
		(fuel-per-minute ?t - truck)
		(load ?t - truck)
  )


(:action LOAD-TRUCK
  :parameters
   (?obj - obj
    ?truck - truck
    ?loc - location)
  :precondition
   (and (at ?truck ?loc) (at ?obj ?loc))
  :effect
   (and (not (at ?obj ?loc)) (in ?obj ?truck) (increase (load ?truck) 1)
		(increase (fuel-per-minute ?truck) (+ (load ?truck) 1))))

(:action UNLOAD-TRUCK
  :parameters
   (?obj - obj
    ?truck - truck
    ?loc - location)
  :precondition
   (and (at ?truck ?loc) (in ?obj ?truck))
  :effect
   (and (not (in ?obj ?truck)) (at ?obj ?loc) (decrease (load ?truck) 1)
		(decrease (fuel-per-minute ?truck) (load ?truck))))


(:action BOARD-TRUCK
  :parameters
   (?driver - driver
    ?truck - truck
    ?loc - location)
  :precondition
   (and (at ?truck ?loc) (at ?driver ?loc) (empty ?truck))
  :effect
   (and (not (at ?driver ?loc)) (driving ?driver ?truck) (not (empty ?truck))))

(:action DISEMBARK-TRUCK
  :parameters
   (?driver - driver
    ?truck - truck
    ?loc - location)
  :precondition
   (and (at ?truck ?loc) (driving ?driver ?truck))
  :effect
   (and (not (driving ?driver ?truck)) (at ?driver ?loc) (empty ?truck)))

(:action DRIVE-TRUCK
  :parameters
   (?truck - truck
    ?loc-from - location
    ?loc-to - location
    ?driver - driver)
  :precondition
   (and (at ?truck ?loc-from)
   (driving ?driver ?truck) (link ?loc-from ?loc-to))
  :effect
   (and (not (at ?truck ?loc-from)) (at ?truck ?loc-to)
		(increase (fuel-used) (* (fuel-per-minute ?truck) (time-to-drive ?loc-from ?loc-to)))))

(:action WALK
  :parameters
   (?driver - driver
    ?loc-from - location
    ?loc-to - location)
  :precondition
   (and (at ?driver ?loc-from) (path ?loc-from ?loc-to))
  :effect
   (and (not (at ?driver ?loc-from)) (at ?driver ?loc-to)))

 
)

; problem
(define (problem DLOG-3-6-13)
	(:domain driverlog)
	(:objects
	driver1 - driver
	driver2 - driver
	driver3 - driver
	truck1 - truck
	truck2 - truck
	truck3 - truck
	truck4 - truck
	truck5 - truck
	truck6 - truck
	package1 - obj
	package2 - obj
	package3 - obj
	package4 - obj
	package5 - obj
	package6 - obj
	package7 - obj
	package8 - obj
	package9 - obj
	package10 - obj
	package11 - obj
	package12 - obj
	package13 - obj
	s0 - location
	s1 - location
	s2 - location
	s3 - location
	s4 - location
	s5 - location
	s6 - location
	s7 - location
	p0-2 - location
	p0-4 - location
	p1-0 - location
	p1-5 - location
	p2-1 - location
	p3-0 - location
	p4-2 - location
	p4-3 - location
	p4-5 - location
	p4-6 - location
	p6-0 - location
	p6-2 - location
	p6-5 - location
	p6-7 - location
	p7-6 - location
	)
	(:init
	(at driver1 s7)
	(at driver2 s4)
	(at driver3 s2)
	(at truck1 s4)
	(empty truck1)
	(= (load truck1) 0)
	(= (fuel-per-minute truck1) 10)
	(at truck2 s1)
	(empty truck2)
	(= (load truck2) 0)
	(= (fuel-per-minute truck2) 10)
	(at truck3 s1)
	(empty truck3)
	(= (load truck3) 0)
	(= (fuel-per-minute truck3) 10)
	(at truck4 s3)
	(empty truck4)
	(= (load truck4) 0)
	(= (fuel-per-minute truck4) 10)
	(at truck5 s0)
	(empty truck5)
	(= (load truck5) 0)
	(= (fuel-per-minute truck5) 10)
	(at truck6 s4)
	(empty truck6)
	(= (load truck6) 0)
	(= (fuel-per-minute truck6) 10)
	(at package1 s0)
	(at package2 s7)
	(at package3 s4)
	(at package4 s0)
	(at package5 s6)
	(at package6 s7)
	(at package7 s6)
	(at package8 s2)
	(at package9 s3)
	(at package10 s4)
	(at package11 s1)
	(at package12 s1)
	(at package13 s3)
	(path s0 p0-2)
	(path p0-2 s0)
	(path s2 p0-2)
	(path p0-2 s2)
	(path s0 p0-4)
	(path p0-4 s0)
	(path s4 p0-4)
	(path p0-4 s4)
	(path s1 p1-0)
	(path p1-0 s1)
	(path s0 p1-0)
	(path p1-0 s0)
	(path s1 p1-5)
	(path p1-5 s1)
	(path s5 p1-5)
	(path p1-5 s5)
	(path s2 p2-1)
	(path p2-1 s2)
	(path s1 p2-1)
	(path p2-1 s1)
	(path s3 p3-0)
	(path p3-0 s3)
	(path s0 p3-0)
	(path p3-0 s0)
	(path s4 p4-2)
	(path p4-2 s4)
	(path s2 p4-2)
	(path p4-2 s2)
	(path s4 p4-3)
	(path p4-3 s4)
	(path s3 p4-3)
	(path p4-3 s3)
	(path s4 p4-5)
	(path p4-5 s4)
	(path s5 p4-5)
	(path p4-5 s5)
	(path s4 p4-6)
	(path p4-6 s4)
	(path s6 p4-6)
	(path p4-6 s6)
	(path s6 p6-0)
	(path p6-0 s6)
	(path s0 p6-0)
	(path p6-0 s0)
	(path s6 p6-2)
	(path p6-2 s6)
	(path s2 p6-2)
	(path p6-2 s2)
	(path s6 p6-5)
	(path p6-5 s6)
	(path s5 p6-5)
	(path p6-5 s5)
	(path s6 p6-7)
	(path p6-7 s6)
	(path s7 p6-7)
	(path p6-7 s7)
	(link s0 s3)
	(link s3 s0)
	(= (time-to-drive s0 s3) 23)
	(= (time-to-drive s3 s0) 23)
	(link s0 s7)
	(link s7 s0)
	(= (time-to-drive s0 s7) 74)
	(= (time-to-drive s7 s0) 74)
	(link s1 s4)
	(link s4 s1)
	(= (time-to-drive s1 s4) 97)
	(= (time-to-drive s4 s1) 97)
	(link s1 s5)
	(link s5 s1)
	(= (time-to-drive s1 s5) 68)
	(= (time-to-drive s5 s1) 68)
	(link s2 s0)
	(link s0 s2)
	(= (time-to-drive s2 s0) 37)
	(= (time-to-drive s0 s2) 37)
	(link s2 s3)
	(link s3 s2)
	(= (time-to-drive s2 s3) 63)
	(= (time-to-drive s3 s2) 63)
	(link s3 s1)
	(link s1 s3)
	(= (time-to-drive s3 s1) 67)
	(= (time-to-drive s1 s3) 67)
	(link s3 s6)
	(link s6 s3)
	(= (time-to-drive s3 s6) 81)
	(= (time-to-drive s6 s3) 81)
	(link s3 s7)
	(link s7 s3)
	(= (time-to-drive s3 s7) 92)
	(= (time-to-drive s7 s3) 92)
	(link s4 s2)
	(link s2 s4)
	(= (time-to-drive s4 s2) 27)
	(= (time-to-drive s2 s4) 27)
	(link s4 s3)
	(link s3 s4)
	(= (time-to-drive s4 s3) 21)
	(= (time-to-drive s3 s4) 21)
	(link s4 s7)
	(link s7 s4)
	(= (time-to-drive s4 s7) 6)
	(= (time-to-drive s7 s4) 6)
	(link s5 s2)
	(link s2 s5)
	(= (time-to-drive s5 s2) 85)
	(= (time-to-drive s2 s5) 85)
	(link s5 s6)
	(link s6 s5)
	(= (time-to-drive s5 s6) 44)
	(= (time-to-drive s6 s5) 44)
	(link s5 s7)
	(link s7 s5)
	(= (time-to-drive s5 s7) 20)
	(= (time-to-drive s7 s5) 20)
	(link s6 s0)
	(link s0 s6)
	(= (time-to-drive s6 s0) 54)
	(= (time-to-drive s0 s6) 54)
	(link s7 s1)
	(link s1 s7)
	(= (time-to-drive s7 s1) 93)
	(= (time-to-drive s1 s7) 93)
	(link s7 s2)
	(link s2 s7)
	(= (time-to-drive s7 s2) 80)
	(= (time-to-drive s2 s7) 80)
	(link s7 s6)
	(link s6 s7)
	(= (time-to-drive s7 s6) 61)
	(= (time-to-drive s6 s7) 61)
	(= (fuel-used) 0)
)
	(:goal (and
	(at driver1 s2)
	(at driver2 s5)
	(at driver3 s4)
	(at truck2 s2)
	(at truck3 s1)
	(at truck6 s2)
	(at package1 s1)
	(at package2 s1)
	(at package4 s0)
	(at package5 s4)
	(at package6 s6)
	(at package7 s7)
	(at package8 s3)
	(at package9 s3)
	(at package10 s7)
	(at package11 s0)
	(at package12 s0)
	(at package13 s4)
	))

(:metric minimize (+ (* 4 (total-time)) (* 4 (fuel-used))))

)

; plan
1. (board-truck driver2 truck6 s4)
   deleted: (at driver2 s4) (empty truck6)
   added: (driving driver2 truck6)
   goals met: 3 of 18
2. (walk driver3 s2 p4-2)
   deleted: (at driver3 s2)
   added: (at driver3 p4-2)
   goals met: 3 of 18
3. (drive-truck truck6 s4 s1 driver2)
   deleted: (at truck6 s4)
   added: (at truck6 s1)
   changed: (fuel-used) from 0 to 970
   goals met: 3 of 18
4. (load-truck package11 truck6 s1)
   deleted: (at package11 s1)
   added: (in package11 truck6)
   changed: (load truck6) from 0 to 1, (fuel-per-minute truck6) from 10 to 11
   goals met: 3 of 18
5. (load-truck package12 truck6 s1)
   deleted: (at package12 s1)
   added: (in package12 truck6)
   changed: (load truck6) from 1 to 2, (fuel-per-minute truck6) from 11 to 13
   goals met: 3 of 18
6. (drive-truck truck6 s1 s7 driver2)
   deleted: (at truck6 s1)
   added: (at truck6 s7)
   changed: (fuel-used) from 970 to 2179
   goals met: 3 of 18
7. (load-truck package2 truck6 s7)
   deleted: (at package2 s7)
   added: (in package2 truck6)
   changed: (load truck6) from 2 to 3, (fuel-per-minute truck6) from 13 to 16
   goals met: 3 of 18
8. (drive-truck truck6 s7 s1 driver2)
   deleted: (at truck6 s7)
   added: (at truck6 s1)
   changed: (fuel-used) from 2179 to 3667
   goals met: 3 of 18
9. (unload-truck package2 truck6 s1)
   deleted: (in package2 truck6)
   added: (at package2 s1)
   changed: (load truck6) from 3 to 2, (fuel-per-minute truck6) from 16 to 13
   goals met: 4 of 18
10. (walk driver3 p4-2 s4)
   deleted: (at driver3 p4-2)
   added: (at driver3 s4)
   goals met: 5 of 18
11. (drive-truck truck6 s1 s4 driver2)
   deleted: (at truck6 s1)
   added: (at truck6 s4)
   changed: (fuel-used) from 3667 to 4928
   goals met: 5 of 18
12. (load-truck package10 truck6 s4)
   deleted: (at package10 s4)
   added: (in package10 truck6)
   changed: (load truck6) from 2 to 3, (fuel-per-minute truck6) from 13 to 16
   goals met: 5 of 18
13. (drive-truck truck6 s4 s2 driver2)
   deleted: (at truck6 s4)
   added: (at truck6 s2)
   changed: (fuel-used) from 4928 to 5360
   goals met: 6 of 18
14. (load-truck package8 truck6 s2)
   deleted: (at package8 s2)
   added: (in package8 truck6)
   changed: (load truck6) from 3 to 4, (fuel-per-minute truck6) from 16 to 20
   goals met: 6 of 18
15. (drive-truck truck6 s2 s7 driver2)
   deleted: (at truck6 s2)
   added: (at truck6 s7)
   changed: (fuel-used) from 5360 to 6960
   goals met: 5 of 18
16. (unload-truck package10 truck6 s7)
   deleted: (in package10 truck6)
   added: (at package10 s7)
   changed: (load truck6) from 4 to 3, (fuel-per-minute truck6) from 20 to 16
   goals met: 6 of 18
17. (load-truck package6 truck6 s7)
   deleted: (at package6 s7)
   added: (in package6 truck6)
   changed: (load truck6) from 3 to 4, (fuel-per-minute truck6) from 16 to 20
   goals met: 6 of 18
18. (drive-truck truck6 s7 s3 driver2)
   deleted: (at truck6 s7)
   added: (at truck6 s3)
   changed: (fuel-used) from 6960 to 8800
   goals met: 6 of 18
19. (unload-truck package8 truck6 s3)
   deleted: (in package8 truck6)
   added: (at package8 s3)
   changed: (load truck6) from 4 to 3, (fuel-per-minute truck6) from 20 to 16
   goals met: 7 of 18
20. (drive-truck truck6 s3 s6 driver2)
   deleted: (at truck6 s3)
   added: (at truck6 s6)
   changed: (fuel-used) from 8800 to 10096
   goals met: 7 of 18
21. (load-truck package7 truck6 s6)
   deleted: (at package7 s6)
   added: (in package7 truck6)
   changed: (load truck6) from 3 to 4, (fuel-per-minute truck6) from 16 to 20
   goals met: 7 of 18
22. (drive-truck truck6 s6 s3 driver2)
   deleted: (at truck6 s6)
   added: (at truck6 s3)
   changed: (fuel-used) from 10096 to 11716
   goals met: 7 of 18
23. (load-truck package13 truck6 s3)
   deleted: (at package13 s3)
   added: (in package13 truck6)
   changed: (load truck6) from 4 to 5, (fuel-per-minute truck6) from 20 to 25
   goals met: 7 of 18
24. (drive-truck truck6 s3 s7 driver2)
   deleted: (at truck6 s3)
   added: (at truck6 s7)
   changed: (fuel-used) from 11716 to 14016
   goals met: 7 of 18
25. (unload-truck package7 truck6 s7)
   deleted: (in package7 truck6)
   added: (at package7 s7)
   changed: (load truck6) from 5 to 4, (fuel-per-minute truck6) from 25 to 20
   goals met: 8 of 18
26. (drive-truck truck6 s7 s0 driver2)
   deleted: (at truck6 s7)
   added: (at truck6 s0)
   changed: (fuel-used) from 14016 to 15496
   goals met: 8 of 18
27. (unload-truck package11 truck6 s0)
   deleted: (in package11 truck6)
   added: (at package11 s0)
   changed: (load truck6) from 4 to 3, (fuel-per-minute truck6) from 20 to 16
   goals met: 9 of 18
28. (load-truck package1 truck6 s0)
   deleted: (at package1 s0)
   added: (in package1 truck6)
   changed: (load truck6) from 3 to 4, (fuel-per-minute truck6) from 16 to 20
   goals met: 9 of 18
29. (drive-truck truck6 s0 s2 driver2)
   deleted: (at truck6 s0)
   added: (at truck6 s2)
   changed: (fuel-used) from 15496 to 16236
   goals met: 10 of 18
30. (drive-truck truck6 s2 s5 driver2)
   deleted: (at truck6 s2)
   added: (at truck6 s5)
   changed: (fuel-used) from 16236 to 17936
   goals met: 9 of 18
31. (drive-truck truck6 s5 s1 driver2)
   deleted: (at truck6 s5)
   added: (at truck6 s1)
   changed: (fuel-used) from 17936 to 19296
   goals met: 9 of 18
32. (unload-truck package1 truck6 s1)
   deleted: (in package1 truck6)
   added: (at package1 s1)
   changed: (load truck6) from 4 to 3, (fuel-per-minute truck6) from 20 to 16
   goals met: 10 of 18
33. (drive-truck truck6 s1 s5 driver2)
   deleted: (at truck6 s1)
   added: (at truck6 s5)
   changed: (fuel-used) from 19296 to 20384
   goals met: 10 of 18
34. (drive-truck truck6 s5 s6 driver2)
   deleted: (at truck6 s5)
   added: (at truck6 s6)
   changed: (fuel-used) from 20384 to 21088
   goals met: 10 of 18
35. (unload-truck package6 truck6 s6)
   deleted: (in package6 truck6)
   added: (at package6 s6)
   changed: (load truck6) from 3 to 2, (fuel-per-minute truck6) from 16 to 13
   goals met: 11 of 18
36. (drive-truck truck6 s6 s5 driver2)
   deleted: (at truck6 s6)
   added: (at truck6 s5)
   changed: (fuel-used) from 21088 to 21660
   goals met: 11 of 18
37. (drive-truck truck6 s5 s2 driver2)
   deleted: (at truck6 s5)
   added: (at truck6 s2)
   changed: (fuel-used) from 21660 to 22765
   goals met: 12 of 18
38. (board-truck driver3 truck1 s4)
   deleted: (at driver3 s4) (empty truck1)
   added: (driving driver3 truck1)
   goals met: 11 of 18
39. (drive-truck truck1 s4 s1 driver3)
   deleted: (at truck1 s4)
   added: (at truck1 s1)
   changed: (fuel-used) from 22765 to 23735
   goals met: 11 of 18
40. (disembark-truck driver3 truck1 s1)
   deleted: (driving driver3 truck1)
   added: (at driver3 s1) (empty truck1)
   goals met: 11 of 18
41. (board-truck driver3 truck2 s1)
   deleted: (at driver3 s1) (empty truck2)
   added: (driving driver3 truck2)
   goals met: 11 of 18
42. (drive-truck truck2 s1 s4 driver3)
   deleted: (at truck2 s1)
   added: (at truck2 s4)
   changed: (fuel-used) from 23735 to 24705
   goals met: 11 of 18
43. (drive-truck truck6 s2 s0 driver2)
   deleted: (at truck6 s2)
   added: (at truck6 s0)
   changed: (fuel-used) from 24705 to 25186
   goals met: 10 of 18
44. (unload-truck package12 truck6 s0)
   deleted: (in package12 truck6)
   added: (at package12 s0)
   changed: (load truck6) from 2 to 1, (fuel-per-minute truck6) from 13 to 11
   goals met: 11 of 18
45. (drive-truck truck6 s0 s6 driver2)
   deleted: (at truck6 s0)
   added: (at truck6 s6)
   changed: (fuel-used) from 25186 to 25780
   goals met: 11 of 18
46. (load-truck package5 truck6 s6)
   deleted: (at package5 s6)
   added: (in package5 truck6)
   changed: (load truck6) from 1 to 2, (fuel-per-minute truck6) from 11 to 13
   goals met: 11 of 18
47. (drive-truck truck6 s6 s7 driver2)
   deleted: (at truck6 s6)
   added: (at truck6 s7)
   changed: (fuel-used) from 25780 to 26573
   goals met: 11 of 18
48. (drive-truck truck6 s7 s4 driver2)
   deleted: (at truck6 s7)
   added: (at truck6 s4)
   changed: (fuel-used) from 26573 to 26651
   goals met: 11 of 18
49. (unload-truck package5 truck6 s4)
   deleted: (in package5 truck6)
   added: (at package5 s4)
   changed: (load truck6) from 2 to 1, (fuel-per-minute truck6) from 13 to 11
   goals met: 12 of 18
50. (unload-truck package13 truck6 s4)
   deleted: (in package13 truck6)
   added: (at package13 s4)
   changed: (load truck6) from 1 to 0, (fuel-per-minute truck6) from 11 to 10
   goals met: 13 of 18
51. (drive-truck truck6 s4 s2 driver2)
   deleted: (at truck6 s4)
   added: (at truck6 s2)
   changed: (fuel-used) from 26651 to 26921
   goals met: 14 of 18
52. (drive-truck truck6 s2 s5 driver2)
   deleted: (at truck6 s2)
   added: (at truck6 s5)
   changed: (fuel-used) from 26921 to 27771
   goals met: 13 of 18
53. (drive-truck truck2 s4 s2 driver3)
   deleted: (at truck2 s4)
   added: (at truck2 s2)
   changed: (fuel-used) from 27771 to 28041
   goals met: 14 of 18
54. (disembark-truck driver3 truck2 s2)
   deleted: (driving driver3 truck2)
   added: (at driver3 s2) (empty truck2)
   goals met: 14 of 18
55. (walk driver3 s2 p4-2)
   deleted: (at driver3 s2)
   added: (at driver3 p4-2)
   goals met: 14 of 18
56. (walk driver3 p4-2 s4)
   deleted: (at driver3 p4-2)
   added: (at driver3 s4)
   goals met: 15 of 18
57. (drive-truck truck6 s5 s7 driver2)
   deleted: (at truck6 s5)
   added: (at truck6 s7)
   changed: (fuel-used) from 28041 to 28241
   goals met: 15 of 18
58. (disembark-truck driver2 truck6 s7)
   deleted: (driving driver2 truck6)
   added: (at driver2 s7) (empty truck6)
   goals met: 15 of 18
59. (board-truck driver1 truck6 s7)
   deleted: (at driver1 s7) (empty truck6)
   added: (driving driver1 truck6)
   goals met: 15 of 18
60. (drive-truck truck6 s7 s2 driver1)
   deleted: (at truck6 s7)
   added: (at truck6 s2)
   changed: (fuel-used) from 28241 to 29041
   goals met: 16 of 18
61. (disembark-truck driver1 truck6 s2)
   deleted: (driving driver1 truck6)
   added: (at driver1 s2) (empty truck6)
   goals met: 17 of 18
62. (walk driver2 s7 p6-7)
   deleted: (at driver2 s7)
   added: (at driver2 p6-7)
   goals met: 17 of 18
63. (walk driver2 p6-7 s6)
   deleted: (at driver2 p6-7)
   added: (at driver2 s6)
   goals met: 17 of 18
64. (walk driver2 s6 p6-5)
   deleted: (at driver2 s6)
   added: (at driver2 p6-5)
   goals met: 17 of 18
65. (walk driver2 p6-5 s5)
   deleted: (at driver2 p6-5)
   added: (at driver2 s5)
   goals met: 18 of 18
